Revit.Elements.Views.View3D.BuildOrientation3D(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Build Orientation3D object for eye point and a target point
eyePoint:
target:
Returns:

Revit.Elements.Views.View3D.GetPointCloud(Autodesk.Revit.DB.Element,System.Collections.Generic.List{Autodesk.Revit.DB.XYZ})
Obtain a sparse point collection outlining a Revit element bt traversing it's
GeometryObject representation
e:
pts:

Revit.Elements.Views.View3D.GetPointCloud(Autodesk.Revit.DB.GeometryInstance,System.Collections.Generic.List{Autodesk.Revit.DB.XYZ})
Obtain a point collection outlining a GeometryObject
geomInst:
pts:

Revit.Elements.Views.View3D.GetPointCloud(Autodesk.Revit.DB.Solid,System.Collections.Generic.List{Autodesk.Revit.DB.XYZ})
Obtain a point collection outlining a Solid GeometryObject
solid:
pts:

Revit.Elements.Views.View3D.IsolateInView(Autodesk.Revit.DB.View3D,Autodesk.Revit.DB.Element)
Make a single element appear in a particular view
view:
element:

Revit.Elements.Views.View3D.IsolateInView(Autodesk.Revit.DB.View3D,Autodesk.Revit.DB.BoundingBoxXYZ)
Set the cropping for the current view
view3D:
bbox:

Revit.Elements.Views.View3D.Create3DView(Autodesk.Revit.DB.ViewOrientation3D,System.String,System.Boolean)
Create a Revit 3D View
orient:
name:
isPerspective:
Returns:

Revit.Elements.Views.View3D.CreateUniqueViewName(System.String)
Determines whether a view with the provided name already exists.
If a view exists with the provided name, and new view is created with
a unique name. Otherwise, the original view name is returned.
name:
Returns: The original name if it is already unique, or
a unique version of the name.

Revit.Elements.Views.View3D.GetVisibleElementFilter
Utility method to create a filtered element collector which collects all elements in a view
which Dynamo would like to view or on which Dynamo would like to operate.
Returns:

Revit.Elements.Views.View3D.InternalSetName(System.String)
Set the name of the current view
name:

Revit.Elements.Views.View3D.InternalSetOrientation(Autodesk.Revit.DB.ViewOrientation3D)
Set the orientation of the view
orient:

Revit.Elements.Views.View3D.InternalIsolateInView(Autodesk.Revit.DB.Element)
Isolate the element in the current view by creating a mininum size crop box around it
element:

Revit.Elements.Views.View3D.InternalIsolateInView(Autodesk.Revit.DB.BoundingBoxXYZ)
Isolate the bounding box in the current view
bbox:

Revit.Elements.Views.View3D.InternalRemoveIsolation
Show all hiddent elements in the view

Revit.Elements.Views.View3D.InternalSetView3D(Autodesk.Revit.DB.View3D)
Set the InternalView3D property and the associated element id and unique id
view:

Revit.Elements.Views.View3D.InternalView3D
An internal handle on the Revit element

Revit.Elements.Views.View3D.InternalElement
Reference to the Element